Revit 2026 API

# LeaderAnchor Property

---

Anchor point of the Leader

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Anchor { get; }
```
```vb
Public ReadOnly Property Anchor As XYZ
	Get
```
```cpp
public:
property XYZ^ Anchor {
	XYZ^ get ();
}
```
```fsharp
member Anchor : XYZ with get
```

#### Property Value

XYZ

Anchor is the leader's point that is attached to an annotation (a tag, note, etc.) This is a read-only property, for the this point gets always computed based on various properties of the annotation element.

#### Reference

Leader Class

Autodesk.Revit.DB Namespace